loadtest.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 25
      name: Start up
    - duration: 120
      arrivalRate: 25
      rampTo: 100
      name: Ramp up load
    - duration: 120
      arrivalRate: 100
      rampTo: 200
      name: Further ramp up load
scenarios:
  - name: "Get Product Reviews"
    flow:
      - get:
          url: "/reviews?product={{$randomNumber(1,1000000)}}"
  - name: "Get Product Review Metadata"
    flow:
      - get:
          url: "/reviews/meta?product_id={{$randomNumber(1,1000000)}}"